grevaillot/svd_tools/headers/ATSAM4S4B/adc.h
#define ADC_CGR_GAIN3_SHIFT		6
#define ADC_CGR_GAIN3_MASK		0x03
/** @defgroup adc_cgr_gain3 GAIN3 Gain for Channel 3
@{*/
/**@}*/


#define ADC_CGR_GAIN2_SHIFT		4
#define ADC_CGR_GAIN2_MASK		0x03
/** @defgroup adc_cgr_gain2 GAIN2 Gain for Channel 2
@{*/
/**@}*/


#define ADC_CGR_GAIN1_SHIFT		2
#define ADC_CGR_GAIN1_MASK		0x03
/** @defgroup adc_cgr_gain1 GAIN1 Gain for Channel 1
@{*/
/**@}*/


#define ADC_CGR_GAIN0_SHIFT		0
#define ADC_CGR_GAIN0_MASK		0x03
/** @defgroup adc_cgr_gain0 GAIN0 Gain for Channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cor COR Channel Offset Register
@{*/

/** ADC_COR_DIFF15 Differential Inputs for Channel 15 **/
#define ADC_COR_DIFF15		(1 << 31)
/** ADC_COR_DIFF14 Differential Inputs for Channel 14 **/
#define ADC_COR_DIFF14		(1 << 30)
/** ADC_COR_DIFF13 Differential Inputs for Channel 13 **/
#define ADC_COR_DIFF13		(1 << 29)
/** ADC_COR_DIFF12 Differential Inputs for Channel 12 **/
#define ADC_COR_DIFF12		(1 << 28)
/** ADC_COR_DIFF11 Differential Inputs for Channel 11 **/
#define ADC_COR_DIFF11		(1 << 27)
/** ADC_COR_DIFF10 Differential Inputs for Channel 10 **/
#define ADC_COR_DIFF10		(1 << 26)
/** ADC_COR_DIFF9 Differential Inputs for Channel 9 **/
#define ADC_COR_DIFF9		(1 << 25)
/** ADC_COR_DIFF8 Differential Inputs for Channel 8 **/
#define ADC_COR_DIFF8		(1 << 24)
/** ADC_COR_DIFF7 Differential Inputs for Channel 7 **/
#define ADC_COR_DIFF7		(1 << 23)
/** ADC_COR_DIFF6 Differential Inputs for Channel 6 **/
#define ADC_COR_DIFF6		(1 << 22)
/** ADC_COR_DIFF5 Differential Inputs for Channel 5 **/
#define ADC_COR_DIFF5		(1 << 21)
/** ADC_COR_DIFF4 Differential Inputs for Channel 4 **/
#define ADC_COR_DIFF4		(1 << 20)
/** ADC_COR_DIFF3 Differential Inputs for Channel 3 **/
#define ADC_COR_DIFF3		(1 << 19)
/** ADC_COR_DIFF2 Differential Inputs for Channel 2 **/
#define ADC_COR_DIFF2		(1 << 18)
/** ADC_COR_DIFF1 Differential Inputs for Channel 1 **/
#define ADC_COR_DIFF1		(1 << 17)
/** ADC_COR_DIFF0 Differential Inputs for Channel 0 **/
#define ADC_COR_DIFF0		(1 << 16)
/** ADC_COR_OFF15 Offset for Channel 15 **/
#define ADC_COR_OFF15		(1 << 15)
/** ADC_COR_OFF14 Offset for Channel 14 **/
#define ADC_COR_OFF14		(1 << 14)
/** ADC_COR_OFF13 Offset for Channel 13 **/
#define ADC_COR_OFF13		(1 << 13)
/** ADC_COR_OFF12 Offset for Channel 12 **/
#define ADC_COR_OFF12		(1 << 12)
/** ADC_COR_OFF11 Offset for Channel 11 **/
#define ADC_COR_OFF11		(1 << 11)
/** ADC_COR_OFF10 Offset for Channel 10 **/
#define ADC_COR_OFF10		(1 << 10)
/** ADC_COR_OFF9 Offset for Channel 9 **/
#define ADC_COR_OFF9		(1 << 9)
/** ADC_COR_OFF8 Offset for Channel 8 **/
#define ADC_COR_OFF8		(1 << 8)
/** ADC_COR_OFF7 Offset for Channel 7 **/
#define ADC_COR_OFF7		(1 << 7)
/** ADC_COR_OFF6 Offset for Channel 6 **/
#define ADC_COR_OFF6		(1 << 6)
/** ADC_COR_OFF5 Offset for Channel 5 **/
#define ADC_COR_OFF5		(1 << 5)
/** ADC_COR_OFF4 Offset for Channel 4 **/
#define ADC_COR_OFF4		(1 << 4)
/** ADC_COR_OFF3 Offset for Channel 3 **/
#define ADC_COR_OFF3		(1 << 3)
/** ADC_COR_OFF2 Offset for Channel 2 **/
#define ADC_COR_OFF2		(1 << 2)
/** ADC_COR_OFF1 Offset for Channel 1 **/
#define ADC_COR_OFF1		(1 << 1)
/** ADC_COR_OFF0 Offset for Channel 0 **/
#define ADC_COR_OFF0		(1 << 0)

/**@}*/

/** @defgroup adc_cdr[0] CDR[0] Channel Data Register
@{*/


#define ADC_CDR[0]_DATA_SHIFT		0
#define ADC_CDR[0]_DATA_MASK		0xfff
/** @defgroup adc_cdr[0]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[1] CDR[1] Channel Data Register
@{*/


#define ADC_CDR[1]_DATA_SHIFT		0
#define ADC_CDR[1]_DATA_MASK		0xfff
/** @defgroup adc_cdr[1]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[2] CDR[2] Channel Data Register
@{*/


#define ADC_CDR[2]_DATA_SHIFT		0
#define ADC_CDR[2]_DATA_MASK		0xfff
/** @defgroup adc_cdr[2]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[3] CDR[3] Channel Data Register
@{*/


#define ADC_CDR[3]_DATA_SHIFT		0
#define ADC_CDR[3]_DATA_MASK		0xfff
/** @defgroup adc_cdr[3]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[4] CDR[4] Channel Data Register
@{*/


#define ADC_CDR[4]_DATA_SHIFT		0
#define ADC_CDR[4]_DATA_MASK		0xfff
/** @defgroup adc_cdr[4]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[5] CDR[5] Channel Data Register
@{*/


#define ADC_CDR[5]_DATA_SHIFT		0
#define ADC_CDR[5]_DATA_MASK		0xfff
/** @defgroup adc_cdr[5]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[6] CDR[6] Channel Data Register
@{*/


#define ADC_CDR[6]_DATA_SHIFT		0
#define ADC_CDR[6]_DATA_MASK		0xfff
/** @defgroup adc_cdr[6]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[7] CDR[7] Channel Data Register
@{*/


#define ADC_CDR[7]_DATA_SHIFT		0
#define ADC_CDR[7]_DATA_MASK		0xfff
/** @defgroup adc_cdr[7]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[8] CDR[8] Channel Data Register
@{*/


#define ADC_CDR[8]_DATA_SHIFT		0
#define ADC_CDR[8]_DATA_MASK		0xfff
/** @defgroup adc_cdr[8]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[9] CDR[9] Channel Data Register
@{*/


#define ADC_CDR[9]_DATA_SHIFT		0
#define ADC_CDR[9]_DATA_MASK		0xfff
/** @defgroup adc_cdr[9]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[10] CDR[10] Channel Data Register
@{*/


#define ADC_CDR[10]_DATA_SHIFT		0
#define ADC_CDR[10]_DATA_MASK		0xfff
/** @defgroup adc_cdr[10]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[11] CDR[11] Channel Data Register
@{*/


#define ADC_CDR[11]_DATA_SHIFT		0
#define ADC_CDR[11]_DATA_MASK		0xfff
/** @defgroup adc_cdr[11]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[12] CDR[12] Channel Data Register
@{*/


#define ADC_CDR[12]_DATA_SHIFT		0
#define ADC_CDR[12]_DATA_MASK		0xfff
/** @defgroup adc_cdr[12]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[13] CDR[13] Channel Data Register
@{*/


#define ADC_CDR[13]_DATA_SHIFT		0
#define ADC_CDR[13]_DATA_MASK		0xfff
/** @defgroup adc_cdr[13]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

