grevaillot/svd_tools/headers/ATSAM4S4B/adc.h
/** @defgroup adc_cdr[14] CDR[14] Channel Data Register
@{*/


#define ADC_CDR[14]_DATA_SHIFT		0
#define ADC_CDR[14]_DATA_MASK		0xfff
/** @defgroup adc_cdr[14]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[15] CDR[15] Channel Data Register
@{*/


#define ADC_CDR[15]_DATA_SHIFT		0
#define ADC_CDR[15]_DATA_MASK		0xfff
/** @defgroup adc_cdr[15]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_acr ACR Analog Control Register
@{*/


#define ADC_ACR_IBCTL_SHIFT		8
#define ADC_ACR_IBCTL_MASK		0x03
/** @defgroup adc_acr_ibctl IBCTL ADC Bias Current Control
@{*/
/**@}*/

/** ADC_ACR_TSON Temperature Sensor On **/
#define ADC_ACR_TSON		(1 << 4)

/**@}*/

/** @defgroup adc_wpmr WPMR Write Protection Mode Register
@{*/


#define ADC_WPMR_WPKEY_SHIFT		8
#define ADC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup adc_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** ADC_WPMR_WPEN Write Protection Enable **/
#define ADC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup adc_wpsr WPSR Write Protection Status Register
@{*/


#define ADC_WPSR_WPVSRC_SHIFT		8
#define ADC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup adc_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** ADC_WPSR_WPVS Write Protection Violation Status **/
#define ADC_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup adc_rpr RPR Receive Pointer Register
@{*/


#define ADC_RPR_RXPTR_SHIFT		0
#define ADC_RPR_RXPTR_MASK		0xffffffff
/** @defgroup adc_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_rcr RCR Receive Counter Register
@{*/


#define ADC_RCR_RXCTR_SHIFT		0
#define ADC_RCR_RXCTR_MASK		0xffff
/** @defgroup adc_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_rnpr RNPR Receive Next Pointer Register
@{*/


#define ADC_RNPR_RXNPTR_SHIFT		0
#define ADC_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup adc_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_rncr RNCR Receive Next Counter Register
@{*/


#define ADC_RNCR_RXNCTR_SHIFT		0
#define ADC_RNCR_RXNCTR_MASK		0xffff
/** @defgroup adc_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_ptcr PTCR Transfer Control Register
@{*/

/** ADC_PTCR_TXTDIS Transmitter Transfer Disable **/
#define ADC_PTCR_TXTDIS		(1 << 9)
/** ADC_PTCR_TXTEN Transmitter Transfer Enable **/
#define ADC_PTCR_TXTEN		(1 << 8)
/** ADC_PTCR_RXTDIS Receiver Transfer Disable **/
#define ADC_PTCR_RXTDIS		(1 << 1)
/** ADC_PTCR_RXTEN Receiver Transfer Enable **/
#define ADC_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup adc_ptsr PTSR Transfer Status Register
@{*/

/** ADC_PTSR_TXTEN Transmitter Transfer Enable **/
#define ADC_PTSR_TXTEN		(1 << 8)
/** ADC_PTSR_RXTEN Receiver Transfer Enable **/
#define ADC_PTSR_RXTEN		(1 << 0)

/**@}*/
